twitter-api/app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:comments).all
---
SELECT "posts".* FROM "posts"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Estamos trabalhando"], ["body", "Não vou fazer isso agora"], ["updated_at", "2023-10-24 20:13:19.831564"], ["id", 3]]